:PROPERTIES:
:ID:       b4ed155f-4f10-4754-95aa-946e4bb2738a
:END:
#+TITLE: Arch: Migrate from Garuda to Omarchy
#+CATEGORY: slips
#+TAGS:

**** BTRFS

By default, there are four mounted subvolumes under =subvolid=5=.

#+begin_src shell :results output verbatim
echo '/@/ subvolid=256,compress=zstd:3,ssd,space_cache=v2
/@/@home/ subvolid=257,compress=zstd:3,ssd,space_cache=v2
/@/@home/.snapshots/ 263
/@/@log/ subvolid=258,compress=zstd:3,ssd,space_cache=v2
/@/@pkg/ subvolid=259,compress=zstd:3,ssd,space_cache=v2
/@/.snapshots/ 262
/@/var/lib/portables/ 260
/@/var/lib/machines/ 261' | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
└── @
    ├── @home
    │   └──  subvolid=257,compress=zstd:3,ssd,space_cache=v2
    ├── @log
    │   └──  subvolid=258,compress=zstd:3,ssd,space_cache=v2
    ├── @pkg
    │   └──  subvolid=259,compress=zstd:3,ssd,space_cache=v2
    ├──  subvolid=256,compress=zstd:3,ssd,space_cache=v2
    └── var
        └── lib
            ├── machines
            │   └──  261
            └── portables
                └──  260

9 directories, 6 files
#+end_example

****** Anyways...

TLDR, what's in [[https://github.com/dcunited001/ellipsis/blob/master/nixos/hosts/kharis/kharis.chroot#L28][this same script]] should basically work, though I guess the
compression options are at mount time. Reboot into the nixos-anywhere iso (btrfs
can't be mounted if operating on the lower-level subvolumes)

To create them

#+begin_src shell
mr=/mnt/foo
disk=/dev/nvme0n1p2
dmap=/dev/mapper/oma
mkdir -p /mnt/foo
cryptsetup open $disk oma
mount $dmap $mr
btrfs subvolume list $mr

# nix/guix
btrfs subvolume create $mr/@nix
btrfs subvolume create $mr/@gnu

umount $mr
#+end_src

Don't create the directories yet. Remount first. Check =/etc/fstab= to make sure
the mount options match

#+begin_src shell
bops=defaults,noatime
mount $dmap -o rw,relatime,compress=zstd:3,ssd,space_cache=v2,subvol=/@ $mr
mkdir $mr/{nix,gnu}
umount $mr
#+end_src

Edit the =/etc/fstab= and add lines for =/nix= and =/gnu=. These directories should be
completely empty when you go to setup =nix= and =guix=

#+begin_src shell :results output verbatim :dir /ssh:kharis:/home/dc :shebang "#!/usr/bin/env bash"
grep -E '(nix|gnu)' /etc/fstab
#+end_src

#+RESULTS:
: UUID=$uuid	/nix    btrfs           rw,defaults,noatime,subvol=/@nix	0 0
: UUID=$uuid	/gnu    btrfs           rw,defaults,noatime,subvol=/@gnu	0 0

**** Mounts

These are the default mounts. This is running on the remote system:

+ =#+headers: :dir /ssh:kharis:/home/dc :shebang #!/usr/bin/env bash=

#+headers: :dir /ssh:kharis:/home/dc :shebang #!/usr/bin/env bash
#+begin_src shell :results output verbatim
mount | cut -f3,5 -d' ' \
    | sort | uniq \
    | sed -e 's/^/root/g' \
    | sed -E 's/ (.*)$/ (\1)/g'\
    | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
└── root
    ├── boot (vfat)
    ├──  (btrfs)
    ├── dev
    │   ├── hugepages (hugetlbfs)
    │   ├── mqueue (mqueue)
    │   ├── pts (devpts)
    │   └── shm (tmpfs)
    ├── dev (devtmpfs)
    ├── home (btrfs)
    ├── proc
    │   └── sys
    │       └── fs
    │          ├── binfmt_misc (autofs)
    │          └── binfmt_misc (binfmt_misc)
    ├── proc (proc)
    ├── run
    │   ├── credentials
    │   │   ├── systemd-journald.service (tmpfs)
    │   │   ├── systemd-networkd.service (tmpfs)
    │   │   └── systemd-resolved.service (tmpfs)
    │   ├── media
    │   │   └── dc
    │   │       └── garuda-root (btrfs)
    │   └── user
    │       ├── 1000
    │       │   ├── doc (fuse.portal)
    │       │   └── gvfs (fuse.gvfsd-fuse)
    │       └── 1000 (tmpfs)
    ├── run (tmpfs)
    ├── sys
    │   ├── firmware
    │   │   └── efi
    │   │       └── efivars (efivarfs)
    │   ├── fs
    │   │   ├── bpf (bpf)
    │   │   ├── cgroup (cgroup2)
    │   │   ├── fuse
    │   │   │   └── connections (fusectl)
    │   │   └── pstore (pstore)
    │   └── kernel
    │       ├── config (configfs)
    │       ├── debug (debugfs)
    │       ├── security (securityfs)
    │       └── tracing (tracefs)
    ├── sys (sysfs)
    ├── tmp (tmpfs)
    └── var
        ├── cache
        │   └── pacman
        │       └── pkg (btrfs)
        └── log (btrfs)

21 directories, 32 files
#+end_example

*** Using JQ
#+name: jqBindsSort
#+begin_example jq
sort_by("\(.key),\(.keycode),\(.modmask)")
#+end_example

This first query's diffable as i would've liked (I guess I tried csv to line up
the tables)

#+name: jqBindsFormat
#+begin_example jq
map([
  .modmask,
  .key,
  .keycode,
  ([
    if (.mouse)           then "m" else "." end,
    if (.release)         then "r" else "." end,
    if (.repeat)          then "e" else "." end,
    if (.non_consuming)   then "n" else "." end,
    if (.has_description) then "d" else "." end,
    if (.catch_all)       then "C" else "." end, # i think this is correct
    if (.longPress)       then "o" else "." end
    ] | join("")),
    .dispatcher,
    .arg,
    .description
  ])
#+end_example

This just lists duplicated keybinds

#+name: jqBindsFormatShort
#+begin_example jq
map([(.key // .keycode), .modmask]   | join("	")) | join("\n")
#+end_example

#+headers: :var qs=jqBindsSort qf=jqBindsFormat
#+begin_src shell :results output verbatim
hypr_instance="71a1216abcc7031776630a6d88f105605c4dc1c9_1759038644_2145885464"
hyprctl binds -j | jq -r "$qs | $qf | map(join(\"	\")) | join(\"\n\")"
#+end_src

#+RESULTS:
#+begin_example
73	$osObsKey	0	.......	movetoworkspace	name:obs
73	$wsDocksKey	0	.......	movetoworkspace	special:docs
32		10	.......	workspace	11
33		10	.......	movetoworkspacesilent	11
64		10	.......	workspace	1
65		10	.......	movetoworkspacesilent	1
32		11	.......	workspace	12
33		11	.......	movetoworkspacesilent	12
64		11	.......	workspace	2
65		11	.......	movetoworkspacesilent	2
32		12	.......	workspace	13
33		12	.......	movetoworkspacesilent	13
64		12	.......	workspace	3
65		12	.......	movetoworkspacesilent	3
0		121	..e....	exec	wpctl set-mute @DEFAULT_AUDIO_SOURCE@ toggle
32		121	.......	togglespecialworkspace	audio
33		121	.......	movetoworkspace	special:audio
0		122	..e....	exec	wpctl set-volume @DEFAULT_AUDIO_SINK@ 5%-
0		123	..e....	exec	wpctl set-volume -l 1 @DEFAULT_AUDIO_SINK@ 5%+
32		123	.......	togglespecialworkspace	music
33		123	.......	movetoworkspace	special:music
64		13	.......	workspace	4
65		13	.......	movetoworkspacesilent	4
64		14	.......	workspace	5
65		14	.......	movetoworkspacesilent	5
64		15	.......	workspace	6
65		15	.......	movetoworkspacesilent	6
64		16	.......	workspace	7
65		16	.......	movetoworkspacesilent	7
64		17	.......	workspace	8
65		17	.......	movetoworkspacesilent	8
0		171	.......	exec	playerctl next
0		172	.......	exec	playerctl play-pause
0		173	.......	exec	playerctl previous
64		18	.......	workspace	9
65		18	.......	movetoworkspacesilent	9
64		19	.......	workspace	10
65		19	.......	movetoworkspacesilent	10
0		256	..e....	exec	wpctl set-mute @DEFAULT_AUDIO_SOURCE@ toggle
0		36	.......	submap	reset
72		74	.......	workspace	108
73		74	.......	movetoworkspacesilent	108
72		75	.......	workspace	109
73		75	.......	movetoworkspacesilent	109
32		87	.......	workspace	11
33		87	.......	movetoworkspacesilent	11
32		88	.......	workspace	12
33		88	.......	movetoworkspacesilent	12
32		89	.......	workspace	13
33		89	.......	movetoworkspacesilent	13
0	1	0	.......	exec	hyprctl notify -1 10000 "rgb(CCCC00)" "$(hyprctl activewindow -j | hjinspect.jq)"
0	A	0	.......	movewindow	l
1	A	0	.......	movefocus	l
0	D	0	.......	movewindow	r
1	D	0	.......	movefocus	r
64	D	0	.......	exec	wofi --show run
72	Delete	0	.......	togglespecialworkspace	discord
73	Delete	0	.......	movetoworkspace	special:discord
64	E	0	.......	exec	thunar
64	F	0	.......	fullscreen	1
69	F	0	.......	fullscreen	0
0	F1	0	.......	exec	hyprctl activewindow -j | hjinspect.jq | wl-copy
72	F1	0	.......	submap	HJINSPECT
32	F10	0	.......	exec	swaync-client -a 3
32	F11	0	.......	exec	swaync-client -a 2
32	F12	0	.......	exec	swaync-client -a 1
72	F9	0	.......	workspace	name:irc
73	F9	0	.......	movetoworkspace	name:irc
0	H	0	.......	movewindow	l
1	H	0	.......	movefocus	l
72	H	0	.......	movefocus	l
0	J	0	.......	movewindow	u
1	J	0	.......	movefocus	u
72	J	0	.......	movefocus	u
0	K	0	.......	movewindow	d
1	K	0	.......	movefocus	d
72	K	0	.......	movefocus	d
0	L	0	.......	movewindow	r
1	L	0	.......	movefocus	r
72	L	0	.......	movefocus	r
64	PRINT	0	....d..	exec	pkill hyprpicker || hyprpicker -a	Color picker
32	Prior	0	.......	togglespecialworkspace	tuitray
33	Prior	0	.......	movetoworkspace	special:tuitray
65	R	0	.......	exec	hyprctl reload
0	S	0	.......	movewindow	d
1	S	0	.......	movefocus	d
72	S	0	.......	togglespecialworkspace	scratch
73	S	0	.......	movetoworkspace	special:scratch
0	W	0	.......	movewindow	u
1	W	0	.......	movefocus	u
0	XF86MonBrightnessDown	0	..e....	exec	brightnessctl s 5%-
0	XF86MonBrightnessUp	0	..e....	exec	brightnessctl s 5%+
64	Z	0	.......	exec	$appMenu --normal-window --show drun --allow-images
65	Z	0	.......	exec	nwg-drawer -mb 10 -mr 10 -ml 10 -mt 10
100	backslash	0	.......	exec	swaync-client -op
32	backslash	0	.......	togglespecialworkspace	roam
33	backslash	0	.......	movetoworkspace	special:roam
100	backspace	0	.......	exec	swaync-client -cp
32	backspace	0	.......	togglespecialworkspace	dotfilesEmacs
33	backspace	0	.......	movetoworkspace	special:dotfilesEmacs
72	d	0	.......	togglespecialworkspace	docs
100	delete	0	.......	exec	swaync-client -d
64	down	0	.......	movefocus	d
65	down	0	.......	movewindow	d
32	equal	0	.......	togglespecialworkspace	dotfilesHypr
33	equal	0	.......	movetoworkspace	special:dotfilesHypr
0	escape	0	.......	submap	reset
0	escape	0	.......	submap	reset
72	escape	0	.......	exec	swaync-client -op
32	home	0	.......	togglespecialworkspace	agenda
33	home	0	.......	movetoworkspace	special:agenda
64	left	0	.......	movefocus	l
65	left	0	.......	movewindow	l
72	m	0	.......	togglespecialworkspace	man
73	m	0	.......	movetoworkspace	special:man
64	mouse:272	0	m......	mouse	movewindow
64	mouse:273	0	m......	mouse	resizewindow
0	mouse:277	0	.......	tagwindow	testopacity active
64	mouse:277	0	.......	setprop	active xray on
0	mouse:280	0	m......	mouse	movewindow
64	mouse:280	0	.......	resizewindowpixel	exact 1920 1080, activewindow,
65	mouse:280	0	.......	resizewindowpixel	exact 1280 720, activewindow,
68	mouse:280	0	.......	resizewindowpixel	exact 960 960, activewindow,
69	mouse:280	0	.......	resizewindowpixel	exact 1120 1050, activewindow,
64	mouse_down	0	.......	workspace	e+1
64	mouse_up	0	.......	workspace	e-1
72	p	0	.......	togglespecialworkspace	pass
73	p	0	.......	movetoworkspace	special:pass
72	pause	0	.......	workspace	name:obs
100	return	0	.......	exec	swaync-client -R; swaync-client -rs
32	return	0	.......	togglespecialworkspace	dotfilesNixos
33	return	0	.......	movetoworkspace	special:dotfilesNixos
64	right	0	.......	movefocus	r
65	right	0	.......	movewindow	r
0	space	0	.......	submap	reset
100	space	0	.......	exec	swaync-client --close-latest
65	space	0	.......	togglefloating
72	space	0	.......	submap	movewin
100	tab	0	.......	exec	swaync-client --hide-latest
64	tab	0	.......	layoutmsg	swapwithmaster
65	tab	0	.......	layoutmsg	rollnext
72	tab	0	.......	layoutmsg	rollnext
73	tab	0	.......	layoutmsg	rollnext
64	up	0	.......	movefocus	u
65	up	0	.......	movewindow	u
#+end_example

**** Diff

Here are the modmap binds to codes

#+headers: :var qs=jqBindsSort qf=jqBindsFormatShort
#+begin_src shell :results output code :wrap example diff
hypr_instance="71a1216abcc7031776630a6d88f105605c4dc1c9_1759038644_2145885464"

# some quoting issues here
diff <(hyprctl binds -j | jq -r "$qs | $qf") \
  <(ssh kharis \
    env HYPRLAND_CMD=Hyprland \
    HYPRLAND_INSTANCE_SIGNATURE="$hypr_instance" \
    hyprctl binds -j | jq -r "$qs | $qf")
#+end_src

#+RESULTS:
#+begin_example diff
1,4d0
< $osObsKey	73
< $wsDocksKey	73
<       32
<       33
7,8d2
<       32
<       33
11,12d4
<       32
<       33
15,21d6
<       0
<       32
<       33
<       0
<       0
<       32
<       33
32,34d16
<       0
<       0
<       0
39,55c21,33
<       0
<       0
<       72
<       73
<       72
<       73
<       32
<       33
<       32
<       33
<       32
<       33
< 1	0
< A	0
< A	1
< D	0
< D	1
---
>       64
>       65
>       64
>       65
> A	64
> A	65
> B	64
> B	65
> BACKSPACE	64
> C	64
> COMMA	64
> COMMA	65
> COMMA	68
57,58c35
< Delete	72
< Delete	73
---
> DELETE	12
59a37,38
> E	68
> ESCAPE	64
61,89c40,78
< F	69
< F1	0
< F1	72
< F10	32
< F11	32
< F12	32
< F9	72
< F9	73
< H	0
< H	1
< H	72
< J	0
< J	1
< J	72
< K	0
< K	1
< K	72
< L	0
< L	1
< L	72
< Prior	32
< Prior	33
< R	65
< S	0
< S	1
< S	72
< S	73
< W	0
< W	1
---
> F1	4
> F11	1
> F11	8
> F2	4
> F2	5
> G	64
> G	65
> G	72
> I	68
> J	64
> K	64
> M	64
> N	64
> N	68
> O	64
> P	64
> PRINT	0
> PRINT	1
> PRINT	12
> PRINT	13
> PRINT	4
> PRINT	64
> PRINT	8
> PRINT	9
> S	68
> SPACE	64
> SPACE	65
> SPACE	68
> SPACE	69
> SPACE	72
> T	64
> TAB	64
> TAB	65
> TAB	68
> Tab	8
> Tab	8
> Tab	9
> Tab	9
> V	64
90a80,93
> X	64
> X	65
> XF86AudioLowerVolume	0
> XF86AudioLowerVolume	8
> XF86AudioMicMute	0
> XF86AudioMute	0
> XF86AudioMute	64
> XF86AudioNext	0
> XF86AudioPause	0
> XF86AudioPlay	0
> XF86AudioPrev	0
> XF86AudioRaiseVolume	0
> XF86AudioRaiseVolume	8
> XF86Calculator	0
91a95
> XF86MonBrightnessDown	8
93,102c97,99
< Z	64
< Z	65
< backslash	100
< backslash	32
< backslash	33
< backspace	100
< backspace	32
< backspace	33
< d	72
< delete	100
---
> XF86MonBrightnessUp	8
> XF86PowerOff	0
> Y	64
105,111d101
< equal	32
< equal	33
< escape	0
< escape	0
< escape	72
< home	32
< home	33
114,115d103
< m	72
< m	73
118,124d105
< mouse:277	0
< mouse:277	64
< mouse:280	0
< mouse:280	64
< mouse:280	65
< mouse:280	68
< mouse:280	69
127,132c108
< p	72
< p	73
< pause	72
< return	100
< return	32
< return	33
---
> return	64
135,143c111
< space	0
< space	100
< space	65
< space	72
< tab	100
< tab	64
< tab	65
< tab	72
< tab	73
---
> slash	64
#+end_example
